import {ChangeDetectionStrategy, Component} from '@angular/core';

@Component({
  selector: 'app-faq',
  templateUrl: './faq.component.html',
  styleUrls: ['./faq.component.scss'],
  changeDetection: ChangeDetectionStrategy.OnPush,
})
export class FaqComponent {
  public readonly panels = [
    { // TODO update body texts
      title: 'Можно ли также оплачивать услуги ?',
      body: 'К сожалению, в данный момент доступен только букинг / резервирование услуг. Однако, мы планируем добавить данную возможность в будущем.',
    },
    {
      title: 'Что будет если на момент оплаты не будет достаточно средств ?',
      body: 'К сожалению, в данный момент доступен только букинг / резервирование услуг. Однако, мы планируем добавить данную возможность в будущем.',
    },
    {
      title: 'Есть ли пробный период ?',
      body: 'К сожалению, в данный момент доступен только букинг / резервирование услуг. Однако, мы планируем добавить данную возможность в будущем.',
    },
    {
      title: 'Возможна ли смена тарифа без смены аккаунта ?',
      body: 'К сожалению, в данный момент доступен только букинг / резервирование услуг. Однако, мы планируем добавить данную возможность в будущем.',
    },
    {
      title: 'Нужно ли верифицировать аккаунт ?',
      body: 'К сожалению, в данный момент доступен только букинг / резервирование услуг. Однако, мы планируем добавить данную возможность в будущем.',
    },
  ];
}
